<a href="https://colab.research.google.com/github/zasminah/Python_DataVisualization/blob/main/Pandas_Groupby.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [47]:
import pandas as pd
import numpy as np
np.random.seed(12345)

df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','tow','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  tow  0.478943  0.092908
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023
4    a  one  1.965781  1.246435

**1)Grouping**

In [48]:
grouped = df['data1'].groupby(df['key1'])
print(grouped) #display only instance information
print(grouped.mean())

<pandas.core.groupby.generic.SeriesGroupBy object at 0x7f8afda7e390>
key1
a    0.746672
b   -0.537585
Name: data1, dtype: float64

In [49]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one     0.880536
      tow     0.478943
b     one    -0.519439
      two    -0.555730
Name: data1, dtype: float64

In [50]:
means3 = df.groupby(['key1','key2'])['data2'].mean()
print(means3, '\n')

s_grouped = df.groupby(['key1', 'key2'])['data2']
print(s_grouped.mean(),'\n')

key1  key2
a     one     1.319920
      tow     0.092908
b     one     0.281746
      two     0.769023
Name: data2, dtype: float64

key1  key2
a     one     1.319920
      tow     0.092908
b     one     0.281746
      two     0.769023
Name: data2, dtype: float64

**2)Group Iteration**

In [51]:
for name, group in df.groupby('key1'):
  print('name:', name)
  print(group,'\n')

name: a
  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  tow  0.478943  0.092908
4    a  one  1.965781  1.246435

name: b
  key1 key2     data1     data2
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023

**3)Group Selection**

In [52]:
people = pd.DataFrame(np.random.randn(5,5),
                      columns = list('abcde'),
                      index = ['Job','Steve','Wes','Jim','Travis'])
people

               a         b         c         d         e
Job     1.007189 -1.296221  0.274992  0.228913  1.352917
Steve   0.886429 -2.001637 -0.371843  1.669025 -0.438570
Wes    -0.539741  0.476985  3.248944 -1.021228 -0.577087
Jim     0.124121  0.302614  0.523772  0.000940  1.343810
Travis -0.713544 -0.831154 -2.370232 -1.860761 -0.860757

In [53]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red'}
by_column = people.groupby(mapping, axis =1)
by_column.sum()

            blue       red
Job     0.503905  1.063885
Steve   1.297183 -1.553778
Wes     2.227716 -0.639844
Jim     0.524712  1.770545
Travis -4.230992 -2.405455

In [54]:
map_series = pd.Series(mapping)
print(map_series)
people.groupby(map_series, axis =1).sum()

a     red
b     red
c    blue
d    blue
e     red
dtype: object

            blue       red
Job     0.503905  1.063885
Steve   1.297183 -1.553778
Wes     2.227716 -0.639844
Jim     0.524712  1.770545
Travis -4.230992 -2.405455

In [55]:
print(people.groupby(len).sum())

key_list = ['one','one','one','two','two']
people.groupby([len, key_list]).min()

          a         b         c         d         e
3  0.591569 -0.516623  4.047708 -0.791374  2.119639
5  0.886429 -2.001637 -0.371843  1.669025 -0.438570
6 -0.713544 -0.831154 -2.370232 -1.860761 -0.860757

              a         b         c         d         e
3 one -0.539741 -1.296221  0.274992 -1.021228 -0.577087
  two  0.124121  0.302614  0.523772  0.000940  1.343810
5 one  0.886429 -2.001637 -0.371843  1.669025 -0.438570
6 two -0.713544 -0.831154 -2.370232 -1.860761 -0.860757